import React from "react";

function AboutGame() {
  return (
    <div className="text-white">
      <h1 className="text-2xl font-medium mb-5">خلاصه بازی</h1>
      <p className="text-base leading-8">
        از دیگر ویژگی‌های بازی God of War وجود عناصر خوب و پرعمق نقش‌آفرینی است.
        نقشه بازی در سبک جهان‌باز طراحی شده که علاوه بر مسیر اصلی داستانی، مملو
        از مأموریت‌های فرعی و جانبی است. شما در طول این مأموریت‌ها، کاراکترهای
        به‌یادماندنی و مهم مختلفی را ملاقات خواهید کرد که هر کدام نقش مهمی در
        این دنیای بزرگ بازی می‌کنند. در طول گشت‌وگذارهای خود، تجهیزات و زره‌های
        مختلفی را پیدا خواهید کرد که هر کدام ویژگی و قابلیت مخصوصی را به کریتوس
        می‌دهند. علاوه بر سلاح جدید شما که یک تبر جادویی با قدرت یخ بوده، در
        بخشی از داستان سلاح قدیمی و معروف کریتوس را نیز به دست خواهید آورد که
        مقابل گونه‌ای خاص از دشمنان کارآمد است. علاوه بر این وجود سیستم Level
        به‌تدریج شما را قدرتمندتر کرده و برای چالش‌های جدید آماده خواهید شد.
      </p>
    </div>
  );
}

export default AboutGame;
